# Используйте официальный образ Node.js в качестве базового образа
FROM node:16-alpine

# Установите рабочую директорию в контейнере
WORKDIR /app

# Копируйте файлы package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Установите зависимости проекта, используя npm
RUN npm install --silent

# Копируйте исходный код проекта в рабочую директорию
COPY . .

# Строим проект, игнорируя предупреждения ESLint
RUN CI=false npm run build

# Откройте порт 3000 для доступа к вашему приложению
EXPOSE 3000

# Команда для запуска вашего приложения
CMD ["npm", "start"]
